app/controllers/schools_controller.rb

  def index
    if params[:query]
      @schools = School.name_like("#{params[:query]}").order(:title).page params[:page]
---
SELECT  `schools`.* FROM `schools` WHERE (title LIKE '%%Bharath senior secondary school%%') ORDER BY `schools`.`title` ASC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `schools` WHERE (title LIKE '%%%%')

  def create
    @school = School.new(school_params)

    respond_to do |format|
      if @school.save
---
INSERT INTO "schools" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", ""], ["created_at", "2020-06-12 19:34:22.266574"], ["updated_at", "2020-06-12 19:34:22.266574"]]

  def destroy
    @school.destroy
---
DELETE FROM "schools" WHERE "schools"."id" = ?  [["id", 1]]

    def set_school
      @school = School.find(params[:id])
---
SELECT  "schools".* FROM "schools" WHERE "schools"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]